[{"mark": "", "year": "2016", "keywords_en": "", "abstract": "Данная работа выполнена в рамках направления компьютерной лингвистики — автоматической генерации текстов на естественном языке (далее АГТ на ЕЯ). Системы АГТ на ЕЯ создаются для того, чтобы сделать возможным автоматическое порождение текстов на ЕЯ, в случаях, когда у человека возникает необходимость регулярно порождать несложные однотипные тексты, например, прогнозы погоды, биржевые новости и т.п. ", "form": "thesis", "course": "6", "title": "Автоматическая генерация текста (на примере биржевых новостей)", "author": {"admission_year": 2014, "a_second_name_en": "Nesterenko", "a_first_name_en": "Liubov", "a_first_name": "Любовь", "a_second_name": "Нестеренко", "a_fathers_name": "Владимировна"}, "keywords": "", "title_en": "Natural Language Generation System for Stock News Generation", "prof": {"t_second_name": "Бонч-Осмоловская", "t_second_name_en": "Bonch-Osmolovskaya", "t_first_name_en": "Anastasiya A.", "t_first_name": "Анастасия", "t_fathers_name": "Александровна"}, "abstract_en": "The subject of this research is related to the field of natural language generation (NLG). NLG systems are usually built to make automatic the process of creating simple texts such as weather report or financial news, etc.", "lang": "ru", "file": ""}, {"mark": "8", "year": "2016", "keywords_en": "", "abstract": "The main goal of this work was to develop a tool for automatic extraction of constructions for a given lemma from dependency annotated treebank of Russian texts, and their preliminary classification, as well as to present the means of processing said corpus, and test the quality of the results. The main motivation behind the development of such tool is its supposed utility for aiding in extension of Russian FrameBank using Russian National Corpus.", "form": "thesis", "course": "6", "title": "Автоматическое выделение и классификация глагольных и именных номинализованных конструкций из синтаксически размеченного корпуса", "author": {"admission_year": 2014, "a_second_name_en": "Mediankin", "a_first_name_en": "Nikita", "a_first_name": "Никита", "a_second_name": "Медянкин", "a_fathers_name": "Сергеевич"}, "keywords": "", "title_en": "Automatic Extraction and Classification of Verb and Nominalization Constructions from Syntactic Corpus of Russian", "prof": {"t_second_name": "Ляшевская", "t_second_name_en": "Lyashevskaya", "t_first_name_en": "Olga", "t_first_name": "Ольга", "t_fathers_name": "Николаевна"}, "abstract_en": "The main goal of this work was to develop a tool for automatic extraction of constructions for a given lemma from dependency annotated treebank of Russian texts, and their preliminary classification, as well as to present the means of processing said corpus, and test the quality of the results. The main motivation behind the development of such tool is its supposed utility for aiding in extension of Russian FrameBank using Russian National Corpus.", "lang": "ru", "file": "http://lms.hse.ru/ap_service.php?getwork=1&guid=8F9327D0-D87B-48EC-AC7B-8349482A3685"}, {"mark": "", "year": "2016", "keywords_en": "", "abstract": "Целью работы является построение графов взаимодействий персонажей в тексте произведения, а также анализ сбалансированости построенных графов.", "form": "thesis", "course": "6", "title": "Автоматическое построение графов для анализа художественных произведений", "author": {"admission_year": 2014, "a_second_name_en": "Tsygankova", "a_first_name_en": "Viktoriia", "a_first_name": "Виктория", "a_second_name": "Цыганкова", "a_fathers_name": "Сергеевна"}, "keywords": "", "title_en": "Automatic Extraction of Social Networks from Literary Text", "prof": {"t_second_name": "Алескеров", "t_second_name_en": "ogly'", "t_first_name_en": "Aleskerov Fuad Tagi", "t_first_name": "Фуад", "t_fathers_name": "Таги"}, "abstract_en": "The goal of the research is to extract social networks from literary texts and to analyze structural balance of the resulting graphs.", "lang": "ru", "file": ""}, {"mark": "8", "year": "2016", "keywords_en": "", "abstract": "Целью данной работы стало: 1) оценить степень влияния семантической информации, не содержащейся в исходном тексте, на качество работы систем автоматического анализа кореферентности и 2) предложить способ интеграции такого рода информации в уже существующие алгоритмы, не учитывавшие ее ранее. Первая цель была достигнута путем проведения эксперимента по сравнению качества работы одного и того же алгоритма разрешения анафоры и кореферентности при наличии и отсутствии семантической информации. Необходимость модификации алгоритма позволила также реализовать вторую из поставленных целей.", "form": "thesis", "course": "6", "title": "Вклад семантической информации в распознавание кореферентных отношений", "author": {"admission_year": 2014, "a_second_name_en": "Azerkovich", "a_first_name_en": "Ilya", "a_first_name": "Илья", "a_second_name": "Азеркович", "a_fathers_name": "Леонидович"}, "keywords": "", "title_en": "Contribution of Semantic Information to Coreference Resolution", "prof": {"t_second_name": "Толдова", "t_second_name_en": "Toldova", "t_first_name_en": "Svetlana", "t_first_name": "Светлана", "t_fathers_name": "Юрьевна"}, "abstract_en": "Main goals of this work was to 1) evaluate the degree of influence of semantic information not contained in the original text on the quality of performance of automated coreference analyzers, and 2) to offer a way to integrate the information of such kind into existing algorithms that don’t originally take it into account. The first goal was achieved by conducting an experiment in comparing the performance quality of an algorithm for resolving anaphoric and coreferential relations with and without taking semantic information into account. The necessity of modifying the algorithm allowed to achieve the second goal as well.", "lang": "ru", "file": "http://lms.hse.ru/ap_service.php?getwork=1&guid=1D73B9AE-6863-4464-996D-10EDF0464B0F"}, {"mark": "9", "year": "2016", "keywords_en": "", "abstract": "В данной работе представлены проект и реализация гибридной системы извлечения именованных сущностей для русского языка в предметной области “Фармацевтика”. Проект реализован в виде кода на языке Python. В основе системы лежит машинное обучение (метод Conditional Random Fields), также используются правила и внешние лексические ресурсы. Система была обучена и протестирована на разных частях корпуса патентных текстов на русском языке, который был вручную собран для этих целей и аннотирован четырьмя типами фармако-химических сущнсотей. Полученные результаты для извлечения данных четырех типов сущностей: F-мера 77.79, точность 90.3, полнота 73.3. В работе также комментируются полученные результаты и обсуждаются перспективы дальнейшей работы.", "form": "thesis", "course": "6", "title": "Извлечение именованных сущностей для предметной области \"Фармацевтика\": разработка и реализация для русского языка", "author": {"admission_year": 2014, "a_second_name_en": "Druzhkina", "a_first_name_en": "Anna", "a_first_name": "Анна", "a_second_name": "Дружкина", "a_fathers_name": "Александровна"}, "keywords": "", "title_en": "Named Entity Recognition for Pharmaceutics Domain: Design and Implementation for the Russian Language", "prof": {"t_second_name": "Ефименко", "t_second_name_en": "Efimenko", "t_first_name_en": "Irina", "t_first_name": "Ирина", "t_fathers_name": "Владимировна"}, "abstract_en": "The paper presents a project and realization of a hybrid named entity recognition system for the Russian language in the Pharmaceutics domain. The project is realized in Python. System architecture is mainly based on machine learning (Conditional Random Fields) accompanied by rules and use of lexical resources. The system was trained and tested on different parts of a corpus of patents, which was manually collected and annotated with 4 types of entities. The achieved results on this corpus are as follows: F-measure 77.79, precision 90.3, recall 73.3. The paper also provides discussion of the results, conclusions and perspectives of future work.", "lang": "ru", "file": "http://lms.hse.ru/ap_service.php?getwork=1&guid=D3D671DE-94AA-42B9-95E6-90D02BF2CDEA"}, {"mark": "9", "year": "2016", "keywords_en": "", "abstract": "Корпусно-ориентированное изучение идиоматики позволяет уточнить и дополнить имеющиеся сведения об идиомах и их модификациях, но в случае широко употребительных фразеологических единиц представляет собой определенный вызов для исследователя. Анализ лингвистом тысячей контекстов для каждой из таких идиом слишком затратен по времени, поэтому вряд ли возможен. Выходом может быть создание вспомогательного инструмента – программы, которая осуществляет автоматический анализ контекстов с идиомами и предоставляет в структурированном виде данные об их модификациях, тем самым облегчая работу лингвиста. О создании такой программы и идёт речь в данной работе.", "form": "thesis", "course": "6", "title": "Изучение варьирования идиом автоматическими методами", "author": {"admission_year": 2014, "a_second_name_en": "Krotova", "a_first_name_en": "Elena", "a_first_name": "Елена", "a_second_name": "Кротова", "a_fathers_name": "Борисовна"}, "keywords": "", "title_en": "Computer-aided Exploration of Idioms' Variation", "prof": {"t_second_name": "Ляшевская", "t_second_name_en": "Lyashevskaya", "t_first_name_en": "Olga", "t_first_name": "Ольга", "t_fathers_name": "Николаевна"}, "abstract_en": "Corpus-driven exploration of idioms can help to specify and enhance available data on idioms and their variation. In case of widely used idioms the amount of corpus data can be however challenging for a researcher. The manual analysis of thousands contexts is time-consuming and therefore questionable. The solution may be to create a tool that conducts an automatic analysis of contexts with idioms and provides structured data about their variation, in this way facilitating the work of the linguist. The development of such a tool is described in the master paper.", "lang": "ru", "file": "http://lms.hse.ru/ap_service.php?getwork=1&guid=3B63E683-0CAF-4C1F-8A42-64F13AE875F5"}, {"mark": "7", "year": "2016", "keywords_en": "", "abstract": "Данная работа посвящена проблеме извлечения отношений в текстах устных воспоминаний, которые редко попадают под внимание автоматической обработки естественного языка. Данные тексты имеют ряд черт, из-за которых работа с ними отличается от работы с обычными текстами и требует определенной специфики. В качестве результата работы представлен граф, показывающий отношения между людьми, упоминающимся в данных устных воспоминаниях.", "form": "thesis", "course": "6", "title": "Исследование методов извлечения отношений с использованием онтологий на материале текстов личных воспоминаний", "author": {"admission_year": 2014, "a_second_name_en": "Piskunov", "a_first_name_en": "Vladimir", "a_first_name": "Владимир", "a_second_name": "Пискунов", "a_fathers_name": "Игоревич"}, "keywords": "", "title_en": "Ontology-Based Relation Extraction in Texts of \"Oral History\" Stories", "prof": {"t_second_name": "Толдова", "t_second_name_en": "Toldova", "t_first_name_en": "Svetlana", "t_first_name": "Светлана", "t_fathers_name": "Юрьевна"}, "abstract_en": "This work is about relation extraction in the unusual kind of texts for natural language processing - \"Oral History\" stories. They are very different from the common ones and a special approach of processing them must be elaborated. As a result of this work a graph is presented, that shows connections and relations between people in \"Oral History\" stories.", "lang": "ru", "file": "http://lms.hse.ru/ap_service.php?getwork=1&guid=81F826F4-B5F0-49CC-AE09-F1E7C0E23BAB"}, {"mark": "8", "year": "2016", "keywords_en": "", "abstract": "Настоящая работа решает задачу автоматического измерения сложности текстов, написанных на русском языке. \"Сложность\" понимается в духе факторного анализа, т.е. как скрытая переменная, влияющая на многие наблюдаемые свойства текстов. Отталкиваясь от заранее известного набора признаков сложности, с помощью анализа корреляций мы находим новые признаки сложности. В частности, предлагается использовать частоты некоторых концовок слов (как то: \"-ция\", \"-ние\"). Расширенный список признаков подвергается процедуре выделения основных компонент, благодаря которой они сводятся к единой оценке сложности.", "form": "thesis", "course": "6", "title": "Метрики удобочитаемости для русского языка.", "author": {"admission_year": 2014, "a_second_name_en": "Druzhkin", "a_first_name_en": "Konstantin", "a_first_name": "Константин", "a_second_name": "Дружкин", "a_fathers_name": "Юрьевич"}, "keywords": "", "title_en": "Readability Metrics for Russian", "prof": {"t_second_name": "Бонч-Осмоловская", "t_second_name_en": "Bonch-Osmolovskaya", "t_first_name_en": "Anastasiya A.", "t_first_name": "Анастасия", "t_fathers_name": "Александровна"}, "abstract_en": "We propose an algorithm for automatic assessment of Russian text readability. Here, \"readability\" is understood as a hidden variable, which influences many observable features of a text. We take a small number of features, which are known to influence text readability. By correlation analysis, we find new such features. For instance, frequency of some word endings is shown to be highly suggestive of the overall text difficulty. The extended set of features is subjected to the procedure of Primary Components Analysis, whereby a single readability measure is obtained.", "lang": "ru", "file": "http://lms.hse.ru/ap_service.php?getwork=1&guid=C8A63CC7-F0B4-4999-8A85-C9D1E6489F6B"}, {"mark": "10", "year": "2016", "keywords_en": "", "abstract": "Исследование посвящено изучению представленности миноритарных языков России в Интернете. Целью исследования является создание количественного описания интернета на миноритарных языках, определение характеристик национальных интернетов и поиск параметров, на основе которых можно предсказать, будет ли представлен малый язык в интернете и в каком объёме. В исследовании были использованы разные внешние данные о языке, такие как число носителей, данные по региону распространения и некоторые другие, а также данные по собранным интернет-коллекциям: количество сайтов на малом языке, количество веб-страниц, токенов, медианное значение количества токенов на веб-страницу.", "form": "thesis", "course": "6", "title": "Миноритарные языки РФ в Интернете: количественное описание и анализ данных", "author": {"admission_year": 2014, "a_second_name_en": "Krylova", "a_first_name_en": "Irina", "a_first_name": "Ирина", "a_second_name": "Крылова", "a_fathers_name": "Владимировна"}, "keywords": "", "title_en": "Representation of Minor Languages of Russia on the Internet: Quantitative Description and Data Analysis", "prof": {"t_second_name": "Орехов", "t_second_name_en": "Orekhov", "t_first_name_en": "Boris", "t_first_name": "Борис", "t_fathers_name": "Валерьевич"}, "abstract_en": "The study is on the representation of minority languages of Russia on the Internet. The aim of the study is to create a quantitative description of the minor languages Internet, to determine the characteristics of national Internets and to find the parameters, which can be used to predict, whether a minor language presents on the Internet and to what extent. The study used different external language data: the number of native speakers, data on the titular region of language distribution etc, as well as the Internet collections data: the number of sites in the minor language, the number of web pages, the tokens, the median value of tokens per web page.", "lang": "ru", "file": "http://lms.hse.ru/ap_service.php?getwork=1&guid=8DC2D2C7-10D0-4CF5-99D7-F04DF114955C"}, {"mark": "9", "year": "2016", "keywords_en": "", "abstract": "В работе рассмотрены 43 миноритарных языка России. В качестве материала для исследования использованы данные, полученные из более чем 1600 сообществ социальной сети Вконтакте. Задачей работы было нарисовать портрет типичного носителя миноритарного языка РФ, анализируя поведение как отдельно взятых пользователей Вконтакте, так и групп пользователей, объединенных в сообщества. Для моделирования поведения были использованы такие данные о пользователях, как возраст, место жительства, а также собственно речевое поведение: участие в диалогах, использование или неиспользование миноритарного языка, количество сообществ, говорящих на миноритарном языке, членом которых является конкретный пользователь и др. Для выявления связей между рассматриваемыми параметрами используется кластерный и корреляционный анализ. В результате исследования все рассматриваемые языки оказались отнесены к одной из четырех групп по степени их представленности в сети Вконтакте и активности их носителей. Кроме того, не выявлено никаких принципиальных различий в поведении носителей крупных и более мелких миноритарных языков, а потому для всех рассмотренных языков составлен единый портрет типичного носителя.", "form": "thesis", "course": "6", "title": "Моделирование речевого поведения носителя миноритарного языка РФ в социальной сети", "author": {"admission_year": 2014, "a_second_name_en": "Zaydelman", "a_first_name_en": "Lyudmila", "a_first_name": "Людмила", "a_second_name": "Зайдельман", "a_fathers_name": "Яковлевна"}, "keywords": "", "title_en": "Native Speaker Speech Behaviour Modelling (Based on Russian Federation Minor Languages in a Social Network)", "prof": {"t_second_name": "Орехов", "t_second_name_en": "Orekhov", "t_first_name_en": "Boris", "t_first_name": "Борис", "t_fathers_name": "Валерьевич"}, "abstract_en": "In the paper we examined 43 minority languages of the Russian Federation. We used data from more than 1600 communities of the Vkontakte social network. The main goal of the research was to compose a portrait of a typical speaker of a minority language of the Russian Federation based on the analysis of both the behavior of individual Vkontakte users and the behavior of groups of users, or so-called communities. To model users' behavior we used such information as their location and their age as well as some speech behavior information: user's involvement in dialogs, information about using or not using a minority language in posts, the number of communities that the user was involved in and so on. To detect relations between the parameters we used cluster analysis and correlation analysis. As a result of the research all languages were separated into four groups depending on their representation in Vkontakte and activity of their speakers. Moreover, no fundamental differences were found between the behavior of speakers of large and smaller languages. That is why a common portrait of a typical speaker was composed for all languages.", "lang": "ru", "file": "http://lms.hse.ru/ap_service.php?getwork=1&guid=12017AE2-36E2-465C-9525-1B16EB2A8776"}, {"mark": "", "year": "2016", "keywords_en": "", "abstract": "Проблема распознавания достоверности новостей является актуальной, особенно в настоящее время, в гетерогенном информационном поле. Поэтому необходимо разработать инструменты, которые позволили бы автоматически с использованием лингвистических методов и моделей определять достоверность или недостоверность новостей, опубликованных в интернет-СМИ.", "form": "thesis", "course": "6", "title": "Применение теории риторической структуры текста для распознавания недостоверных новостных сообщений", "author": {"admission_year": 2014, "a_second_name_en": "Pisarevskaya", "a_first_name_en": "Dina", "a_first_name": "Дина", "a_second_name": "Писаревская", "a_fathers_name": "Борисовна"}, "keywords": "", "title_en": "Rhetorical Structure Theory Application in the Detection of Deceptive News Stories", "prof": {"t_second_name": "Толдова", "t_second_name_en": "Toldova", "t_first_name_en": "Svetlana", "t_first_name": "Светлана", "t_fathers_name": "Юрьевна"}, "abstract_en": "Deception detection in news stories is an urgent problem, especially in our contemporary world where we deal with the large amount of information got from diverse sources. New tools for automated deception detection and information verification in online media, based on linguistics methods and models, are required in our society.", "lang": "ru", "file": ""}, {"mark": "9", "year": "2016", "keywords_en": "", "abstract": "В работе рассматривается роль разрешения местоименной анафоры в улучшении качества дистрибутивно-семантических моделей посредством увеличения количества контекстуальной информации для знаменательных слов. Анафоры заменяются на антецеденты в тренировочном корпусе, исследуется степень влияния этой процедуры на получившиеся дитрибутивные модели, качество которых оценивается на золотых стандартах RUSSE '15 и SimLex-999. Модели, обученные на корпусе с разрешенной анафорой демонстрируют стабильный прирост качества.", "form": "thesis", "course": "6", "title": "Разрешение анафорических связей как метод лингвистической предобработки обучающих корпусов для дистрибутивно-семантических моделей", "author": {"admission_year": 2014, "a_second_name_en": "Kozlova", "a_first_name_en": "Olga", "a_first_name": "Ольга", "a_second_name": "Козлова", "a_fathers_name": "Сергеевна"}, "keywords": "", "title_en": "Anaphora Resolution as a Method of Linguistic Preprocessing of Training Corpora for Distributional Semantic Models.", "prof": {"t_second_name": "Кутузов", "t_second_name_en": "Kutuzov", "t_first_name_en": "Andrey Borisovich", "t_first_name": "Андрей", "t_fathers_name": "Борисович"}, "abstract_en": "This thesis addresses the role of linguistic preprocessing in enhancing performance of distributional models, and particularly exploits pronominal anaphora resolution as a way to retrieve more co-occurrence data without directly increasing the size of the training corpus. ", "lang": "ru", "file": "http://lms.hse.ru/ap_service.php?getwork=1&guid=CA3177A0-8FD0-487A-A22F-08E865E98717"}, {"mark": "8", "year": "2016", "keywords_en": "", "abstract": "Целью данной работы было оценить вклад различных характеристик относительной конструкции в выбор стратегии релятивизации подлежащего в русском. На корпусных данных мы построили модели двух типов: дерево решений и мультиномиальную модель. Зависимой переменной была стратегия релятивизации: относительное придаточное предложение с союзным словом который, причастный оборот в препозиции и в постпозиции. В качестве независимых переменных выступили различные характеристики вершины относительной конструкции, глагольной формы в релятиве и конструкции в целом. Несмотря на то, что модели были построены на небольшой выборке (всего 388 примеров), нам удалось выявить некоторые статистически значимые закономерности и описать влияние значимых факторов на выбор стратегии не только качественно, но и количественно.", "form": "thesis", "course": "6", "title": "Регрессионный анализ факторов, влияющих на выбор стратегии релятивизации в русском языке", "author": {"admission_year": 2014, "a_second_name_en": "Mescheriakova", "a_first_name_en": "Evgeniia", "a_first_name": "Евгения", "a_second_name": "Мещерякова", "a_fathers_name": "Игоревна"}, "keywords": "", "title_en": "A Predictive Model of the Different Relativization Strategies in Russian", "prof": {"t_second_name": "Ландер", "t_second_name_en": "Lander", "t_first_name_en": "Yury", "t_first_name": "Юрий", "t_fathers_name": "Александрович"}, "abstract_en": "Целью данной работы было оценить вклад различных характеристик относительной конструкции в выбор стратегии релятивизации подлежащего в русском. На корпусных данных мы построили модели двух типов: дерево решений и мультиномиальную модель. Зависимой переменной была стратегия релятивизации: относительное придаточное предложение с союзным словом который, причастный оборот в препозиции и в постпозиции. В качестве независимых переменных выступили различные характеристики вершины относительной конструкции, глагольной формы в релятиве и конструкции в целом. Несмотря на то, что модели были построены на небольшой выборке (всего 388 примеров), нам удалось выявить некоторые статистически значимые закономерности и описать влияние значимых факторов на выбор стратегии не только качественно, но и количественно.", "lang": "ru", "file": "http://lms.hse.ru/ap_service.php?getwork=1&guid=7C0B8319-79AE-4FFC-913D-B82BCAEE12BD"}, {"mark": "", "year": "2016", "keywords_en": "", "abstract": "This work presents the Universal Dependency (UD) annotated corpus for Russian and a conversion process which was developed to transform The SynTagRus dependency treebank of Russian into a UD annotated corpus. The aim of this work is to create a UD annotated corpus for Russian since no such corpus was available prior to UD release 1.3 and to investigate the influence of morphological tagsets on syntactic annotation during dependency parsing.", "form": "thesis", "course": "6", "title": "Система тегов Universal Dependencies для русского языка", "author": {"admission_year": 2014, "a_second_name_en": "Droganova", "a_first_name_en": "Kira", "a_first_name": "Кира", "a_second_name": "Дроганова", "a_fathers_name": "Андреевна"}, "keywords": "", "title_en": "Universal Dependencies Tagset for Russian", "prof": {"t_second_name": "Ляшевская", "t_second_name_en": "Lyashevskaya", "t_first_name_en": "Olga", "t_first_name": "Ольга", "t_fathers_name": "Николаевна"}, "abstract_en": "This work presents the Universal Dependency (UD) annotated corpus for Russian and a conversion process which was developed to transform The SynTagRus dependency treebank of Russian into a UD annotated corpus. The aim of this work is to create a UD annotated corpus for Russian since no such corpus was available prior to UD release 1.3 and to investigate the influence of morphological tagsets on syntactic annotation during dependency parsing.", "lang": "ru", "file": ""}, {"mark": "9", "year": "2016", "keywords_en": "", "abstract": "Purpose", "form": "thesis", "course": "6", "title": "Снятие лексической омонимии в дистрибутивно-семантических моделях на основе искусственных нейронных сетей (для русского языка)", "author": {"admission_year": 2014, "a_second_name_en": "Motina", "a_first_name_en": "Nadezhda", "a_first_name": "Надежда", "a_second_name": "Мотина", "a_fathers_name": "Евгеньевна"}, "keywords": "", "title_en": "Word Sense Induction in Neural Embedding Models in Russian", "prof": {"t_second_name": "Кутузов", "t_second_name_en": "Kutuzov", "t_first_name_en": "Andrey Borisovich", "t_first_name": "Андрей", "t_fathers_name": "Борисович"}, "abstract_en": "Purpose", "lang": "ru", "file": "http://lms.hse.ru/ap_service.php?getwork=1&guid=9D929B27-2B05-421B-BB89-D058F4364C8D"}, {"mark": "10", "year": "2016", "keywords_en": "", "abstract": "Работа включает в себя три главы (теоретическую, исследовательскую, экспериментальную), заключение, список литературы и два приложения. В теоретической главе приведен обзор литературы, затрагивающей проблему нормы употребления деепричастных оборотов. В исследовательской главе представлен анализ факторов, влияющих на нарушение употребления деепричастных оборотов в текстах письменной и устной речи на материале Корпуса русских учебных текстов и Звукового корпуса русского языка. В экспериментальной главе описан эксперимент, в ходе которого было выявлено соотношение влияния таких факторов, как позиция деепричастного оборота относительно матричной клаузы и наличие или отсутствие семантического субъекта в основной клаузе, на определение степени приемлемости предложений носителями языка. Эксперимент показал, что более значимым для носителей русского языка является фактор позиции деепричастного оборота.", "form": "thesis", "course": "6", "title": "Факторы, влияющие на нарушение кореференции деепричастных оборотов", "author": {"admission_year": 2014, "a_second_name_en": "Puzhaeva", "a_first_name_en": "Svetlana", "a_first_name": "Светлана", "a_second_name": "Пужаева", "a_fathers_name": "Юрьевна"}, "keywords": "", "title_en": "Factors Which Determine the Lack of Coreference in Russian Converbs", "prof": {"t_second_name": "Зевахина", "t_second_name_en": "Zevakhina", "t_first_name_en": "Natalia", "t_first_name": "Наталья", "t_fathers_name": "Александровна"}, "abstract_en": "The work consists of three chapters (theoretical, research, experimental), conclusion, bibliography and two attachments. The theoretical chapter provides an overview of the literature, which adress the problem of the usage of verbal adverb phrases’ standard. The research chapter provides an analysis of the factors, which affect the use of infringement converb phrases in the texts of written and spoken language based on a material of the Corpus of Russian Student Texts and Speech Corpus of Russian Language. The experimental chapter describes an experiment, where the ratio of the impact of factors, such as participial phrases position on the matrix clauses and the presence or absence of the semantic subject of the main clause, to determinition of the degree of acceptability of the sentences was revealed by native speakers. The experiment showed that the most important factor for Russian native speakers is the position of participle phrases.", "lang": "ru", "file": "http://lms.hse.ru/ap_service.php?getwork=1&guid=3802FE58-88E2-4252-9AA7-9D4A763C86CC"}, {"mark": "9", "year": "2016", "keywords_en": "", "abstract": "В работе представлен анализ конструкций низкочастотных русских глаголов. Исследованы более 250 редких лексем, которые были классифицированы по нескольким признакам (происхождение, количество валентностей, глаголы-гиперонимы, частотности). Проведен эксперимент, в котором респонденты делали выбор между реально существующей конструкцией глагола и конструкцией глагола-синонима. Составлена база низкочастотных русских глаголов, представленная в машиночитаемом виде.", "form": "thesis", "course": "6", "title": "Экспериментальное исследование конструкций новых глаголов", "author": {"admission_year": 2014, "a_second_name_en": "Buylova", "a_first_name_en": "Nadezhda", "a_first_name": "Надежда", "a_second_name": "Буйлова", "a_fathers_name": "Николаевна"}, "keywords": "", "title_en": "Experimental Recearch of New Verbs' Construction", "prof": {"t_second_name": "Ляшевская", "t_second_name_en": "Lyashevskaya", "t_first_name_en": "Olga", "t_first_name": "Ольга", "t_fathers_name": "Николаевна"}, "abstract_en": "The paper presents an analysis of the constructions of low-frequency russian verbs. We researched more than 250 rare tokens, which were classified according to several criteria (origin, the number of valences, hyperonyms, frequency). An experiment in which respondents were to choose between real-life design and construction of the verb-synonym was held. The low-frequency base of Russian verbs was compiled and represented in machine-readable form.", "lang": "ru", "file": "http://lms.hse.ru/ap_service.php?getwork=1&guid=180B0ECE-AEEB-4764-8BE1-152DAA6AFBFD"}, {"mark": "", "year": "2016", "keywords_en": "", "abstract": "В настоящем исследование используются экспериментальные методы для проверки зависимости выбора стратегии релятивизации вершины относительной конструкции в русском языке от таких факторов как одушевленность вершины и тип текста. В ходе работы над исследованием был собран и размечен корпус из 1000 употреблений относительных конструкций, а также организован онлайн-эксперимент. Анализ результатов эксперимента методом множественной логистической регрессии не подтвердил наличие зависимости между тестируемыми переменными.", "form": "thesis", "course": "6", "title": "Экспериментальный анализ факторов, влияющих на выбор стратегии релятивизации подлежащего в русском языке", "author": {"admission_year": 2014, "a_second_name_en": "Sino", "a_first_name_en": "Ekaterina", "a_first_name": "Екатерина", "a_second_name": "Сино", "a_fathers_name": "Дмитриевна"}, "keywords": "", "title_en": "Factors Affecting the Choice of a Strategy of Subject Relativization in Russian, Experimental Analysis", "prof": {"t_second_name": "Бонч-Осмоловская", "t_second_name_en": "Bonch-Osmolovskaya", "t_first_name_en": "Anastasiya A.", "t_first_name": "Анастасия", "t_fathers_name": "Александровна"}, "abstract_en": "This paper deals with variation of subject and object relativization strategy in Russian. In particular, it is investigated experimentally how the factors animacy and text type affect the choice between two strategies (participial construction or relative construction with a conjunctive word который). The present study provides collecting and marking of dataset of 1000 instances of relative constructions. It also contains online psycholinguistic experiment. Multiple logistic regression analysis of experiment’s results did not show any significant relationship between variables that were tested.", "lang": "ru", "file": ""}, {"mark": "", "year": "2015", "keywords_en": "", "abstract": "Русский язык, как и многие другие языки, изменчив. Это порождает некоторые трудрости для его изучения, в частности, для лексикографии: зачастую словарь, ещё в момент публикации оказывается достаточно устаревшим и не отражает современное состояние языка. В частности это может выражаться в том, что с момента сбора данных для словаря до момента его публикации в языке успевают ассимилироваться новые слова. Существует некоторое количество работ, посвящённых автоматизации поиска новых слов, но и они не лишены ограничений. В частности, среди них нет работ, посвящённых русскому языку. В настоящей работе представляется часть проекта по созданию службы для полуавтоматического поиска новых слов в русском языке.", "form": "thesis", "course": "6", "title": "Автоматическое извлечение и классификация неологизмов", "author": {"admission_year": 2013, "a_second_name_en": "Юрьевна", "a_first_name_en": "Сидорова Елена", "a_first_name": "Елена", "a_second_name": "Сидорова", "a_fathers_name": "Юрьевна"}, "keywords": "", "title_en": "", "prof": {"t_second_name": "Алексеевский", "t_second_name_en": "Андреевич", "t_first_name_en": "Алексеевский Даниил", "t_first_name": "Даниил", "t_fathers_name": "Андреевич"}, "abstract_en": "", "lang": "ru", "file": ""}, {"mark": "", "year": "2015", "keywords_en": "", "abstract": "Работа посвящена автоматическому извлечению высказываний из русскоязычных новостных текстов. Даётся обзор существующих подходов к решению данной задачи, описываются существующие системы и ресурсы.Предпринимается попытка создать инструмент автоматического определения прямой и косвенной речи и её атрибуции. Приводится оценка качества и анализ ошибок.", "form": "thesis", "course": "6", "title": "Автоматическое извлечение пар «автор-высказывание» из русскоязычных текстов", "author": {"admission_year": 2013, "a_second_name_en": "Вадимовна", "a_first_name_en": "Кузнецова Мария", "a_first_name": "Мария", "a_second_name": "Кузнецова", "a_fathers_name": "Вадимовна"}, "keywords": "", "title_en": "", "prof": {"t_second_name": "Кутузов", "t_second_name_en": "Борисович", "t_first_name_en": "Кутузов Андрей", "t_first_name": "Андрей", "t_fathers_name": "Борисович"}, "abstract_en": "", "lang": "ru", "file": ""}, {"mark": "", "year": "2015", "keywords_en": "", "abstract": "Работа посвящена оценке степени похожести переводов англоязычных произведений В. В. Набокова, выполненных разными авторами, с помощью количественных метрик.", "form": "thesis", "course": "6", "title": "Вариативность языковых единиц в множественных переводах художественных текстов (на материале прозы В.В. Набокова)", "author": {"admission_year": 2013, "a_second_name_en": "Александровна", "a_first_name_en": "Жеребцова Яна", "a_first_name": "Яна", "a_second_name": "Жеребцова", "a_fathers_name": "Александровна"}, "keywords": "", "title_en": "", "prof": {"t_second_name": "Орехов", "t_second_name_en": "Валерьевич", "t_first_name_en": "Орехов Борис", "t_first_name": "Борис", "t_fathers_name": "Валерьевич"}, "abstract_en": "", "lang": "ru", "file": ""}, {"mark": "", "year": "2015", "keywords_en": "", "abstract": "Автоматическое выделение иронии является частным случаем определения тональности текста и извлечения мнений. Выделение иронии требует учёта всех аспектов языка, от пунктуации до семантики, что даёт простор для разнообразных подходов к решению этой задачи. На сегодняшний день построено большое количество моделей для распознавания иронии для текстов на английском языке и некоторых других, однако, для русского языка такой модели нет. Во всех программах для распознавания иронии использовано машинное обучение (с учителем или без). Целью данной работы является выявление некоторых параметров, которые можно было использовать в подобной программе для текстов на русском языке.", "form": "thesis", "course": "6", "title": "Выявление значимых лингвистическиx параметров для автоматического распознавания иронии в русском языке", "author": {"admission_year": 2013, "a_second_name_en": "Александровна", "a_first_name_en": "Панова Татьяна", "a_first_name": "Татьяна", "a_second_name": "Панова", "a_fathers_name": "Александровна"}, "keywords": "", "title_en": "", "prof": {"t_second_name": "Толдова", "t_second_name_en": "Юрьевна", "t_first_name_en": "Толдова Светлана", "t_first_name": "Светлана", "t_fathers_name": "Юрьевна"}, "abstract_en": "", "lang": "ru", "file": ""}, {"mark": "10", "year": "2015", "keywords_en": "", "abstract": "Цель данной работы состоит в проектировании и разработке алгоритма семантической разметки критического аппарата текста, а именно именного указателя одного академического собрания сочинений – Полного собрания сочинений Л. Н. Толстого.", "form": "thesis", "course": "6", "title": "Дигитализация критического аппарата текста для веб-публикации академических собраний сочинений", "author": {"admission_year": 2013, "a_second_name_en": "Сергеевна", "a_first_name_en": "Картышева Мария", "a_first_name": "Мария", "a_second_name": "Картышева", "a_fathers_name": "Сергеевна"}, "keywords": "", "title_en": "", "prof": {"t_second_name": "Бонч-Осмоловская", "t_second_name_en": "Александровна", "t_first_name_en": "Бонч-Осмоловская Анастасия", "t_first_name": "Анастасия", "t_fathers_name": "Александровна"}, "abstract_en": "", "lang": "ru", "file": "http://lms.hse.ru/ap_service.php?getwork=1&guid=F7835A79-F149-41E2-9EAD-ED58EE5D04CF"}, {"mark": "", "year": "2015", "keywords_en": "", "abstract": "В работе представлены результаты машинного обучения на корпусе, содержащем разметку глагольных актантов, с целью классификации метафорических и неметафорических употреблений глаголов.", "form": "thesis", "course": "6", "title": "Идентификация метафорических употреблений русских глаголов методами машинного обучения на основе корпуса с разметкой глагольных аргументов", "author": {"admission_year": 2013, "a_second_name_en": "Геннадьевна", "a_first_name_en": "Бадрызлова Юлия", "a_first_name": "Юлия", "a_second_name": "Бадрызлова", "a_fathers_name": "Геннадьевна"}, "keywords": "", "title_en": "", "prof": {"t_second_name": "Ляшевская", "t_second_name_en": "Николаевна", "t_first_name_en": "Ляшевская Ольга", "t_first_name": "Ольга", "t_fathers_name": "Николаевна"}, "abstract_en": "", "lang": "ru", "file": ""}, {"mark": "10", "year": "2015", "keywords_en": "", "abstract": "В работе при помощи методики сетей рассматривается морфология башкирского языка. Представляется, что некоторые характеристики сети, вершинами которой являются аффиксы, отражают некоторые языковые явления. При помощи такой сети мы рассматриваем следующие вопросы: 1) длина максимально длинной зафиксированной цепочки; 2) степень транскатегориальности в языке; 3) нарушение правил сингармонизма; 4) линейный порядок аффиксов в башкирском языке.", "form": "thesis", "course": "6", "title": "Квантитативный анализ морфологии башкирского языка при помощи метода социальных сетей", "author": {"admission_year": 2013, "a_second_name_en": "Павлович", "a_first_name_en": "Кирьянов Денис", "a_first_name": "Денис", "a_second_name": "Кирьянов", "a_fathers_name": "Павлович"}, "keywords": "", "title_en": "", "prof": {"t_second_name": "Орехов", "t_second_name_en": "Валерьевич", "t_first_name_en": "Орехов Борис", "t_first_name": "Борис", "t_fathers_name": "Валерьевич"}, "abstract_en": "", "lang": "ru", "file": "http://lms.hse.ru/ap_service.php?getwork=1&guid=1A50F6CE-800B-4036-A590-6D2F94EE69AA"}, {"mark": "9", "year": "2015", "keywords_en": "", "abstract": "Работа посвящена анализу пунктуации Корпуса текстов школьников. Работа состоит из двух частей, технологической и аналитической. В первой части рассматриваются вопросы создания корпуса, принципов классификации пунктуационных ошибок и технологии разработки разметчика Интерробанг. Вторая часть посвящена анализу данных и примеров, полученных в результате обработки текстов корпуса.", "form": "thesis", "course": "6", "title": "Корпус текстов школьников с разметкой пунктуационных ошибок", "author": {"admission_year": 2013, "a_second_name_en": "Николаевна", "a_first_name_en": "Выборнова Анна", "a_first_name": "Анна", "a_second_name": "Выборнова", "a_fathers_name": "Николаевна"}, "keywords": "", "title_en": "", "prof": {"t_second_name": "Ляшевская", "t_second_name_en": "Николаевна", "t_first_name_en": "Ляшевская Ольга", "t_first_name": "Ольга", "t_fathers_name": "Николаевна"}, "abstract_en": "", "lang": "ru", "file": "http://lms.hse.ru/ap_service.php?getwork=1&guid=36E8AFA9-9377-4983-88DA-DF57CDEECC02"}, {"mark": "", "year": "2015", "keywords_en": "", "abstract": "Настоящая работа посвящена разработке методов поиска и исправления ошибок автоматического синтаксического анализа. В работе рассматриваются существующие методы, которые позволяют эффективно находить и исправлять ошибки разметки, и предлагается алгоритм, осуществляющий поиск ошибок автоматического синтаксического анализа, данные его практического применения и результаты экспериментов с различными параметрами, а также алгоритм исправления ошибок автоматического синтаксического анализа, которые способны улучшить качество разметки синтаксических корпусов, а также обеспечить более простое и быстрое исправление разметки новых синтаксических корпусов русского языка.", "form": "thesis", "course": "6", "title": "Методы автоматического распознавания и исправления ошибок в синтаксической разметке", "author": {"admission_year": 2013, "a_second_name_en": "Павловна", "a_first_name_en": "Трофимова Дарья", "a_first_name": "Дарья", "a_second_name": "Трофимова", "a_fathers_name": "Павловна"}, "keywords": "", "title_en": "", "prof": {"t_second_name": "Толдова", "t_second_name_en": "Юрьевна", "t_first_name_en": "Толдова Светлана", "t_first_name": "Светлана", "t_fathers_name": "Юрьевна"}, "abstract_en": "", "lang": "ru", "file": ""}, {"mark": "", "year": "2015", "keywords_en": "", "abstract": "Работа содержит описание опыта существующих ресурсов в сфере учебных корпусов. В работы представлены существующие схемы разметки, используемые в учебных корпусах. Пересмотрена существующая классификации ошибок в корпусе RLC и разработана подробная инструкция для увеличения уровня согласованности среди разметчиков.", "form": "thesis", "course": "6", "title": "Оптимизация системы тэгирования в корпусе Russian Learner Corpus", "author": {"admission_year": 2013, "a_second_name_en": "Олеговна", "a_first_name_en": "Лошкарева Дарья", "a_first_name": "Дарья", "a_second_name": "Лошкарева", "a_fathers_name": "Олеговна"}, "keywords": "", "title_en": "", "prof": {"t_second_name": "Рахилина", "t_second_name_en": "Владимировна", "t_first_name_en": "Рахилина Екатерина", "t_first_name": "Екатерина", "t_fathers_name": "Владимировна"}, "abstract_en": "", "lang": "ru", "file": ""}, {"mark": "", "year": "2015", "keywords_en": "", "abstract": "В данной работе рассматривается проблема снятия семантической омонимии в НКРЯ. Был разработан алгоритм автоматизации снятия омонимии и на основе этого алгоритма разработана программа на языке Python.", "form": "thesis", "course": "6", "title": "Снятие омонимии на основе материалов НКРЯ", "author": {"admission_year": 2013, "a_second_name_en": "Михайловна", "a_first_name_en": "Данейко Анастасия", "a_first_name": "Анастасия", "a_second_name": "Данейко", "a_fathers_name": "Михайловна"}, "keywords": "", "title_en": "", "prof": {"t_second_name": "Алексеевский", "t_second_name_en": "Андреевич", "t_first_name_en": "Алексеевский Даниил", "t_first_name": "Даниил", "t_fathers_name": "Андреевич"}, "abstract_en": "", "lang": "ru", "file": ""}, {"mark": "7", "year": "2015", "keywords_en": "", "abstract": "В задаче анализа тональности текстов при самых разных подходах востребованы словари эмоционально-окрашенных слов. Для русского языка достаточно объемного, качественно размеченного и находящегося в открытом доступе словаря пока не существует. В данной работе описываются этапы создания тонального словаря для русского языка - от сбора прилагательных до создания краудсорсинговой игры для разметки.", "form": "thesis", "course": "6", "title": "Составление словаря эмоционально-окрашенных прилагательных русского языка", "author": {"admission_year": 2013, "a_second_name_en": "Петровна", "a_first_name_en": "Кулакова Елена", "a_first_name": "Елена", "a_second_name": "Кулакова", "a_fathers_name": "Петровна"}, "keywords": "", "title_en": "", "prof": {"t_second_name": "Алексеевский", "t_second_name_en": "Андреевич", "t_first_name_en": "Алексеевский Даниил", "t_first_name": "Даниил", "t_fathers_name": "Андреевич"}, "abstract_en": "", "lang": "ru", "file": "http://lms.hse.ru/ap_service.php?getwork=1&guid=4A367536-E315-41B9-AFF5-EDFB44265DC9"}, {"mark": "", "year": "2015", "keywords_en": "", "abstract": "Целью данной работы является формализация значений градуальных прилагательных. За основу взято классическое представление о градуальных прилагательных как отрезках на абстрактных представлениях различных измерений -– шкалах. Однако, такой подход не учитывает семантику прилагательных, которые включают в себя семантику сразу нескольких параметров -– таких, как \"интересный\", \"важный\" и т.д. В работе был предложен способ описания таких прилагательных при помощи типологии, основанной на пяти базовых семантических компонентах: измеримости, объективности, оценочности, экспериенциальности и силе степени. Было предложено формальное представление семантики ряда прилагательных, а также описана в терминах семантических компонентов наречная модификация в русском языке.", "form": "thesis", "course": "6", "title": "Типология прилагательных и наречная модификация в русском языке", "author": {"admission_year": 2013, "a_second_name_en": "Сергеевна", "a_first_name_en": "Филиппова Наталия", "a_first_name": "Наталия", "a_second_name": "Филиппова", "a_fathers_name": "Сергеевна"}, "keywords": "", "title_en": "", "prof": {"t_second_name": "Зевахина", "t_second_name_en": "Александровна", "t_first_name_en": "Зевахина Наталья", "t_first_name": "Наталья", "t_fathers_name": "Александровна"}, "abstract_en": "", "lang": "ru", "file": ""}]